js/artillery/config.yaml
config:
  target: https://nameof-clouddesk.aka.corp.amazon.com:3000
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 5
      arrivalRate: 1
      # rampTo: 50
      name: Slow consistent requests
    # - duration: 10
    #   arrivalRate: 50
    #   rampTo: 10
    #   name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  variables:
    id:
      - '5026356150001'
      - '594094548171872452'
      - '577550071282002919'
      - '3621556210401'
      - '4541492570401'
scenarios:
  - flow:
        - get:
            url: '/dsp/ENTITY3NWTTFDT6USZU/line-items/{{ id }}/edit?nextUX=true'
    count: 100