js/artillery/config.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 50
      name: FAST warm up phase
    - duration: 10
      arrivalRate: 50
      rampTo: 10
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  variables:
    id:
      - '123'
      - '234'
      - '345'
      - '456'
      - '567'
      - '678'
      - '789'
      - '890'
      - '901'
      - '012'
scenarios:
  - flow:
        - get:
            url: '/dynamic/{{ id }}/mfe'
    count: 100